import kotlin.random.Random

/* fun main() {
val myArray=arrayOf(7,0,5,0,2,12,4,28)
    //println(whoMax(myArray))


    }



fun whoMax(inputArray:Array<Int>):Int{
    var max=inputArray[0]   //переменной присвоили значение первого элемента массива
    var x=1                 //ввели переменную со значением 1
    while (x<inputArray.size) {  //цикл работает пока значение "х" не сравняется с размером массива
        var item = inputArray[x]  //ввели переменную которая равна значениею элемента массива под номером "х"
        max = if (max >= item) max else item /*переменной "мах" присвоили новое значение,
        если "мах" больше "х" эемента в массиве, то "мах" остается "мах", если нет то "мах" становится элемент
        массива под номером "х"
       */
        x = x + 1 //берем следующий элемент массива и сравниваем с результатом предыдущего сравнения
    }
    return max
    }

 */
